homedory/ERIKA-OS-on-STM32/Controller/src/code.c
/* ###*B*###
 * ERIKA Enterprise - a tiny RTOS for small microcontrollers
 *
 * Copyright (C) 2002-2013  Evidence Srl
 *
 * This file is part of ERIKA Enterprise.
 *
 * ERIKA Enterprise is free software; you can redistribute it
 * and/or modify it under the terms of the GNU General Public License
 * version 2 as published by the Free Software Foundation,
 * (with a special exception described below).
 *
 * Linking this code statically or dynamically with other modules is
 * making a combined work based on this code.  Thus, the terms and
 * conditions of the GNU General Public License cover the whole
 * combination.
 *
 * As a special exception, the copyright holders of this library give you
 * permission to link this code with independent modules to produce an
 * executable, regardless of the license terms of these independent
 * modules, and to copy and distribute the resulting executable under
 * terms of your choice, provided that you also meet, for each linked
 * independent module, the terms and conditions of the license of that
 * module.  An independent module is a module which is not derived from
 * or based on this library.  If you modify this code, you may extend
 * this exception to your version of the code, but you are not
 * obligated to do so.  If you do not wish to do so, delete this
 * exception statement from your version.
 *
 * ERIKA Enterprise is distributed in the hope that it will be
 * useful, but WITHOUT ANY WARRANTY; without even the implied warranty
 * of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License version 2 for more details.
 *
 * You should have received a copy of the GNU General Public License
 * version 2 along with ERIKA Enterprise; if not, write to the
 * Free Software Foundation, Inc., 51 Franklin Street, Fifth Floor,
 * Boston, MA 02110-1301 USA.
 * ###*E*### */

#include "ee.h"
#include "stm32f4xx.h"
#include "led.h"
#include "sensor.h"
#include "usart.h"
#include "stub.h"

GPIO_InitTypeDef  GPIO_InitStructure;


/*
 * SysTick ISR2
 */
ISR2(systick_handler)
{
	/* count the interrupts, waking up expired alarms */
	CounterTick(myCounter);
	CounterTick(additionalCounter);
}

ISR2 (tim3_handler)
{
	TIM3_IRQHandler();
}

ISR2 (usart2_handler)
{
	USART2_IRQHandler();
}


TASK(LightLED)
{
	toggleLED();
}

TASK(SensorDetect)
{
	sensorStart();
}

TASK(FindShortestPath)
{

}

#define MAX_ROUND 5;

TASK(TaskIOToggle)
{

	static EE_UINT8 act = 0;

	switch (act) {
	case 0:
		GPIO_SetBits(GPIOD, GPIO_Pin_12);
		act = (act + 1) % MAX_ROUND;
	break;
	case 1:
		GPIO_SetBits(GPIOD, GPIO_Pin_13);
		act = (act + 1) % MAX_ROUND;
	break;
	case 2:
		GPIO_SetBits(GPIOD, GPIO_Pin_14);
		act = (act + 1) % MAX_ROUND;
	break;
	case 3:
		GPIO_SetBits(GPIOD, GPIO_Pin_15);
		act = (act + 1) % MAX_ROUND;
	break;
	case 4:
		GPIO_ResetBits(GPIOD, GPIO_Pin_12|GPIO_Pin_13|GPIO_Pin_14|GPIO_Pin_15);
		act = (act + 1) % MAX_ROUND;
	break;
	}
}

int main(void)
{

	/* Preconfiguration before using DAC----------------------------------------*/
	GPIO_InitTypeDef GPIO_InitStructure;

	/*
	 * Setup the microcontroller system.
	 * Initialize the Embedded Flash Interface, the PLL and update the
	 * SystemFrequency variable.
	 * For default settings look at:
	 * pkg/mcu/st_stm32_stm32f4xx/src/system_stm32f4xx.c
	 */
	SystemInit();

	/*Initialize Erika related stuffs*/
	EE_system_init();

	/*Initialize systick */
	EE_systick_set_period(MILLISECONDS_TO_TICKS(1, SystemCoreClock));
	EE_systick_enable_int();
	EE_systick_start();

	/* GPIOD Periph clock enable */
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOD, ENABLE);

	/* Configure PD12, PD13, PD14 and PD15 in output pushpull mode */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_12 | GPIO_Pin_13 | GPIO_Pin_14 | GPIO_Pin_15;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
	GPIO_Init(GPIOD, &GPIO_InitStructure);

	/* Program cyclic alarms which will fire after an initial offset,
	 * and after that periodically
	 * */
	SetRelAlarm(AlarmToggle, 10, 2000);
	SetRelAlarm(AlarmSensor, 10, 1000);

	TIM2_Initialize();
	TIM3_Initialize();
	TIM4_Initialize();
	USART2_Initialize();


	displayText(1, "RPC Control");
	delayms(5000);
	moveMotor(180);
	delayms(5000);
	moveMotor(0);
	delayms(5000);

	while(terminateRPC("quit") != 0) {
		moveMotor(180);
		delayms(5000);
		moveMotor(0);
		delayms(5000);
		displayText(1, "RPC Control");
		delayms(5000);
	}

	offLED();
//	for (;;);

}

